import React, {Component} from 'react'
import './Product.css'

import {Link} from 'react-router-dom'

class Product extends Component {
    render(){
        return(
            <div>
                 <div className="product-page-content">
                            <div className="product-page-text-cont-b">
                                <div className="product-page-b">
                                    <div className="img-picture-product-line">
                                            <div className="product-pictures-line">
                                                <img src="/images/product1.jpg" alt="Product images"/>
                                            </div>
                                    </div>  
                                    <div className="text-product-line">
                                        <div className="product-category-names-line">
                                            <ul className="ul-product-category-names-line">
                                                <li>Аккардионы</li>
                                                <li><i className="fa fa-chevron-right icon"></i></li>
                                            </ul>
                                            <h3>HOHNER NOVA III 96 (A4271) WHITE</h3>
                                        </div>
                                        <div className="product-item number">
                                            <p>Артикул: <span>4564544646465564</span></p>
                                        </div>
                                        <div className="product-text-short-description">
                                            <p>Кнопочный аккордеон 7/8, трехголосный, в правой клавиатуре - 72 кнопки, 5 регистров, в левой клавиатуре - 96 басов, 3 регистра, цвет белый, B-stepped, вес 7 электрогитара, цвет белый, корпус - махогани с верхом из кленового шпона, материал грифа - махогани, профиль грифа - SlimTaper™ “D”, крепление грифа к корпусу - вклеенный, накладка - палисандр, лады - 22 medium jumbo, радиус накладки грифа - 12`, инкрустация в виде прямоугольников, ширина верхнего порожка - 1.680” (43 mm), мензура - 24,75` (628.7 мм), звукосниматели - H/H Pro-Bucker-3™/Pro-Bucker-2™, регуляторы - 2 громкости с переключателями push/pull, 2 тона, 3-х позиционный переключатель звук</p>
                                        </div>
                                    </div>

                                    <div className="text-product-line-two">
                                        <div className="produc-price-sale-b-line">
                                            <div className="product-price-b-line">
                                                <p className="old-price-p-line"><span>28 899 руб.</span>  -3 000</p>
                                                <p className="price-p-line">25 899 руб.</p>
                                            </div>
                                        </div>
                                    </div>

                                    <div className="product-pay-default-btn-b-line">
                                        <Link className="product-btn-default-pay-line" to="/">В корзину</Link>       
                                    </div>
                                </div>
                            </div>
                      </div>


                        <div className="product-page-menu-b">
                            <ul className="ul-product-menu-description">
                                <li><Link className="a-product-description-activ" to="#">ОПИСАНИЕ</Link></li>
                            </ul>
                        </div>


                       <div className="product-page-menu-text-b">

                            <ul className="ul-product-menu-description">
                                <li>
                                    <div>
                                    <p>Модель Les Paul Custom дебютировала в 1954 году, сразу после успешной модели Les Paul Goldtop. Сам Лес Пол стремился донести до публики, что цельнокорпусная электрогитара - это не какая-то причуда, но полноценный музыкальный инструмент, а его именная модель Les Paul - лучшая среди всех существующих электрогитар. Итак, Лес Пол сделать для него гитары, которые наиболее лучшим образом сочетались бы с его смокингом - модели полностью чёрного и белого цветов с золотой фурнитурой.
В результате появилась модель Les Paul Custom, или “tuxedo” (англ. - смокинг) Les Paul, как называли эту модель фанаты Лес Пола. Очень скоро эта модель стала наиболее узнаваемой в мире и сам Лес Пол использовал Les Paul Custom на концертах, еженедельном телевизионном шоу  с его женой Мэри Форд, а также на обложках музыкальных альбомов, включая известный дуэт с Четом Эткинсом "Chester and Lester".


    Корпус
Основным отличием конструкции Les Paul Сustom от моделей Standard и GoldTop является корпус, изготовленный из цельного махогани без полостей. Epiphone Les Paul Сustom также изготавливают из цельного махогани, но с верхом из кленового шпона, который, как известно, добавляет звучанию дополнительную остроту и яркость. Также, как и на оригинальной модели Custom, гриф Epiphone Les Paul Сustom изготавливается из цельного махогани и имеет стандартную мензуру 24,75". Гриф вклеивается в корпус вручную, для обеспечения лучшего их контакта между собой, таким образом вся гитара резонирует как единое целое. Накладка грифа изготавливается из палисандра с инкрустацией в виде прямоугольников и имеет радиус 12", ширина верхнего порожка 1,68" (43 мм).
Гриф гитара имеет очень удобный профиль SlimTaper™ “D”. Корпус с двух сторон и голова грифа имеют пятислойную чёрно-белую окантовку. Накладка грифа также имеет окантовку кремового цвета. На крышечке анкера в виде колокольчика нанесено название модели “Les Paul Custom PRO”. Модель доступна в двух вариантах цвета корпуса - чёрный (Ebony) и белый (Alpine White).


    Электроника
Теперь на модели Les Paul Custom Pro  устанавливаются новые звукосниматели Epiphone ProBucker™ с раздельными выводами с каждой из катушек, позволяющие отсекать одну из катушек, также как и на оригинальных Gibson BurstBuckers™. ProBucker™ воспроизводят звучание классических звукоснимателей PAF, производимых вручную, разработанных впервые Сетом Лавером (Seth Lover) на фабрике Gibson в Каламазу. в конце 50-х годов. Звучание этих звукоснимателей феноменально - то самое, правильное звучание, которое можно получить от винтажных звукосниматлей.
На гитарах Les Paul Custom PRO установлены Pro-Bucker-2™ в позиции около грифа и Pro-Bucker-3™ около бриджа. Pro-Bucker-3™ немного мощнее, чем Pro-Bucker-2™, для баланса по громкости с нековым звукоснимателем и большей остроты в звучании для исполнения сольных партий.Оба звукоснимателя Pro-Bucker™ имеют возможность отсечки катушек при помощи переключателя push/pull на ручках громкости, что даёт дополнительные возможности получения разнообразных оттенков звучания.


    Фурнитура
Epiphone придерживается стратегии изготовления только качественных музыкальных инструментов для музыкантов разного профессионального уровня. Это требует особого внимания к деталям, в частности и к фурнитуре. На гитарах Epiphone устанавливаются только надёжная металлическая фурнитура, включая высококачественные колки Grover® , бридж Tune-o-matic™ и струнодержатель StopBar на гитарах с системой фиксации LockTone, которая позволяет не только упростить процесс замены струн, но и значительно улучшает сустейн.</p>

                                </div>
                            </li>

                            </ul>
                               
                       </div>
            </div>
        )
    }
}

export default Product
